Revit 2027 API
FabricationPartSizeMap.ServiceId Property
 The service identifier of the straight.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ServiceId { get; set; }
Public Property ServiceId As Integer
	Get
	Set
public:
property int ServiceId {
	int get ();
	void set (int value);
}
member ServiceId : int with get, set
Property Value
Int32
See Also
Reference
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace